app/controllers/users_controller.rb

INSERT INTO "users" ("username", "password_digest", "is_maker?", "name", "address", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @user = User.new(user_params)
    if @user && @user.valid?
      @user.save

SELECT "users".* FROM "users" WHERE "users"."username" = ? LIMIT ?  [["username", "jobu"], ["LIMIT", 1]]
---
  def log_in
    @user = User.find_by(username: user_params[:username])